# Парсинг индекса человеческого развития

С помощью библиотеки __urlopen__ мы запарсили индекс человеческого развития, который в последующем будет выступать целевой переменной(на этапе машинного обучения). Фактически, мы запарсили 25 сайтов.

Далее идёт чисто техническая работа с кодом, поэтому мы не будем вдаваться в подробности. Также определённые ячейки и строки в финальном файле(тот, который вы видите сейчас) намеренно сделаны без запуска, чтобы избежать пелены с кучей знаков.

In [1]:
from urllib.request import urlopen
url = "https://countryeconomy.com/hdi?year=1997"
page = urlopen(url)

In [2]:
html_bytes = page.read()
html = html_bytes.decode("utf-8")

In [8]:
#html

In [9]:
#!pip install requests_html

In [11]:
from requests_html import HTMLSession
s = HTMLSession()
r = s.get(url)
table = r.html.find('table')
#print(table[0].html)

In [12]:
tabledata =[[c.text for c in row.find('td')] for row in table[0].find('tr')]

In [13]:
import pandas as pd
df = pd.DataFrame(tabledata)

In [14]:
df

                      0      1     2     3     4
0                  None   None  None  None  None
1     United States [+]  0.890    1º           0
2    United Kingdom [+]  0.842   16º           0
3           Germany [+]  0.874    9º           1
4            France [+]  0.838   18º           1
..                  ...    ...   ...   ...   ...
148           Samoa [+]  0.670   68º          -2
149           Yemen [+]  0.427  130º          -1
150    South Africa [+]  0.651   79º           7
151          Zambia [+]  0.413  132º           0
152        Zimbabwe [+]  0.472  117º          -1

[153 rows x 5 columns]

In [20]:
s = HTMLSession()

big_df = pd.DataFrame()
for i in range(1996, 2022):
  url = "https://countryeconomy.com/hdi?year=" + str(i)
  r = s.get(url)
  table = r.html.find('table')
  tabledata =pd.DataFrame([[c.text for c in row.find('td')] for row in table[0].find('tr')])
  tabledata['year']=i
  #big_df = big_df.append(tabledata, ignore_index=True)

In [17]:
big_df

                       0      1     2     3     4  year
0                   None   None  None  None  None  1996
1      United States [+]  0.887    1º           0  1996
2     United Kingdom [+]  0.834   16º           0  1996
3            Germany [+]  0.868    8º           0  1996
4             France [+]  0.833   17º           1  1996
...                  ...    ...   ...   ...   ...   ...
4744           Samoa [+]  0.707  111º          -1  2021
4745           Yemen [+]  0.455  183º           0  2021
4746    South Africa [+]  0.713  109º           7  2021
4747          Zambia [+]  0.565  154º           0  2021
4748        Zimbabwe [+]  0.593  146º           1  2021

[4749 rows x 6 columns]

#### Таблицу с индексами мы записываем в отдельный файл, чтобы было удобно объединить с основным датасетом

In [18]:
big_df.to_csv('index.csv')

In [19]:
len(big_df[1].unique())

666